[
    {
      "title": "Inventory management and company sales",
      "stack": ["java", "square-git", "trello"],
      "description": "The Pack Sales Management System, developed in Java, offers a complete solution for start-up companies dedicated to the sale of product packs. It allows detailed sales management, invoicing and customer tracking, as well as customized product pack creation. It also provides advanced inventory control with low stock alerts, supplier and bank management, and detailed reporting for strategic analysis. With an intuitive interface, this system simplifies business operations and improves efficiency in the management of product pack sales.",
      "folder": "DreamGifts",
      "imgs": ["Thumb.jpeg", "administracion.gif", "ventas.gif", "inventario.gif", "compras.gif"],
      "link": "",
      "github": "https://github.com/ludwig-espinosa/losjavaleros.git"
    },
    {
      "title": "Midi Piano App",
      "stack": ["react", "html5", "css3-alt", "js", "git"],
      "description": "Application for those who want to see what they play on the piano,it allows you to easily connect a keyboard via midi and see the notes played in real time.you only need to connect the piano/instrument and open the application,",
      "folder": "MidiPiano",
      "imgs": ["piano.gif","Thumb.jpeg"],
      "link": "",
      "github": "https://github.com/nicovenegas2/MidiPianoApp.git"
    },
    {
      "title": "Graph algorithms Visualizer",
      "stack": ["python", "square-github"],
      "description": "This interactive simulation developed in Python allows users to create nodes and connect them together to visualize graph search algorithms. With dynamic animations, it shows how these algorithms find solutions by exploring the graph. This tool not only facilitates the understanding of search algorithms, but also allows users to experiment and explore different scenarios.",
      "folder": "Graph",
      "imgs": ["grafo2.gif", "Thumb.gif"],
      "link": "",
      "github": "https://github.com/nicovenegas2/Grafy-Visualization.git"
    },
    {
      "title": "Pizza Delivery Web",
      "stack": ["react", "html5", "css3-alt", "js", "git"],
      "description": "The website developed in React allows the purchase of pizzas with an integrated shopping cart and a contact form. It is intuitive and user-friendly, allowing users to browse pizza options, add items to the cart and complete the purchase easily. In addition, the contact form facilitates communication with the customer service team for additional questions or comments.",
      "folder": "PizzaShop",
      "imgs": ["Menu.jpeg","Thumb.jpeg", "Pay.jpeg", "MenuOverview.gif"],
      "link": "",
      "github": "https://github.com/nicovenegas2/pizza-shop.git"
    },
    {
      "title": "employee management and overtime",
      "stack": ["docker", "jenkins", "node", "git", "html5","css3-alt"],
      "description": "Employee management system based on microservices that allows you to record the hours of entry and exit of employees, in addition to calculating the salary of employees taking into account, the employee's position, days worked, overtime and absences, this reading a file given by the administrative.",
      "folder": "Empleados",
      "imgs": ["pagos.jpeg", "empleados.jpeg", "Thumb.jpeg", "justificativos.jpeg"],
      "link": "",
      "github": ""
    },
    {
      "title": "Proyecto 6",
      "stack": ["java", "git"],
      "description": "Descripción del Proyecto 6.",
      "folder": "DreamGifts",
      "imgs": ["Thumb.jpeg"],
      "link": "",
      "github": ""
    }
]
  